<a href="https://colab.research.google.com/github/ChamisaE/-project-name-/blob/master/cedmo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

importing city csv

In [ ]:
city_df = pd.read_csv("/content/drive/My Drive/Copy_of_cities.csv")

In [ ]:
city_df

      id       name  ...    country  country_state
0      5   Aberdeen  ...   Scotland            NaN
1      6   Adelaide  ...  Australia            NaN
2      7    Algiers  ...    Algeria            NaN
3      9     Ankara  ...     Turkey            NaN
4     16      Belém  ...     Brazil            NaN
..   ...        ...  ...        ...            ...
329  265     Nantes  ...     France            NaN
330  110  Stockholm  ...     Sweden            NaN
331  266     Rennes  ...     France            NaN
332   15    Beijing  ...      China            NaN
333   69     London  ...    England            NaN

[334 rows x 7 columns]

Get df details

In [ ]:
city_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             334 non-null    int64
 1   name           334 non-null    object
 2   coords         334 non-null    object
 3   start_year     331 non-null    float64
 4   url_name       334 non-null    object
 5   country        334 non-null    object
 6   country_state  134 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 18.4+ KB

Delete start year column

In [ ]:
del city_df['start_year']

In [ ]:
city_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             334 non-null    int64
 1   name           334 non-null    object
 2   coords         334 non-null    object
 3   url_name       334 non-null    object
 4   country        334 non-null    object
 5   country_state  134 non-null    object
dtypes: int64(1), object(5)
memory usage: 15.8+ KB

Filled nan with "no state" to drop later.

In [ ]:
city_df.fillna('no state')

      id       name  ...    country country_state
0      5   Aberdeen  ...   Scotland      no state
1      6   Adelaide  ...  Australia      no state
2      7    Algiers  ...    Algeria      no state
3      9     Ankara  ...     Turkey      no state
4     16      Belém  ...     Brazil      no state
..   ...        ...  ...        ...           ...
329  265     Nantes  ...     France      no state
330  110  Stockholm  ...     Sweden      no state
331  266     Rennes  ...     France      no state
332   15    Beijing  ...      China      no state
333   69     London  ...    England      no state

[334 rows x 6 columns]

turning current version city into csv

In [ ]:
city_df.to_csv('city_clean.csv')

importing systems csv

In [ ]:
system_df = pd.read_csv("/content/drive/My Drive/Copy_of_systems.csv")

Getting info on system data- going to keep all columns.

In [ ]:
system_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 488 entries, 0 to 487
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       488 non-null    int64
 1   city_id  488 non-null    int64
 2   name     287 non-null    object
dtypes: int64(2), object(1)
memory usage: 11.6+ KB

drop nan rows from table

In [ ]:
system_df.head(20)

    id  city_id name
0    1        5  NaN
1    2        6  NaN
2    3        7  NaN
3    4        8  NaN
4    5        9  NaN
5    6       16  NaN
6    7       10  NaN
7    8       11  NaN
8    9       12  NaN
9   10       13  NaN
10  11       17  NaN
11  12       18  NaN
12  14       20  NaN
13  15       22  NaN
14  17       24  NaN
15  18       25  NaN
16  19       26  NaN
17  21       28  NaN
18  23       30  NaN
19  24       31  NaN

In [ ]:
#system_df.dropna(how='all')

In [ ]:
system_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 488 entries, 0 to 487
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       488 non-null    int64
 1   city_id  488 non-null    int64
 2   name     287 non-null    object
dtypes: int64(2), object(1)
memory usage: 11.6+ KB

In [ ]:
system_df.fillna('no transit system name')

      id  city_id                                 name
0      1        5               no transit system name
1      2        6               no transit system name
2      3        7               no transit system name
3      4        8               no transit system name
4      5        9               no transit system name
..   ...      ...                                  ...
483  460      114                         Moka Railway
484  411      114                             Ryutetsu
485  334      114        Tokyo Tama Intercity Monorail
486  316      114  Tokyo Waterfront Area Rapid Transit
487  462      114        Utsunomiya Light Rail Company

[488 rows x 3 columns]

Turn current version of systems into csv

In [ ]:
system_df.to_csv('system_clean.csv')